In [1]:
import numpy as np
import pandas as pd

In [2]:
d1 = {'Name': ['Pankaj', 'Meghna', 'David', 'Lisa'], 'ID': [1, 2, 3, 4], 'Salary': [100, 200, np.nan, pd.NaT],
      'Role': ['CEO', None, pd.NaT, pd.NaT]}

In [3]:
df = pd.DataFrame(d1)

In [4]:
print(df)

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None
2   David   3    NaN   NaT
3    Lisa   4    NaT   NaT

In [5]:
df.head(2)

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None

In [6]:
df.tail(2)

    Name  ID Salary Role
2  David   3    NaN  NaT
3   Lisa   4    NaT  NaT

In [7]:
df.isnull().sum()

Name      0
ID        0
Salary    2
Role      3
dtype: int64

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   ID      4 non-null      int64
 2   Salary  2 non-null      object
 3   Role    1 non-null      object
dtypes: int64(1), object(3)
memory usage: 260.0+ bytes

In [9]:
df1 = df.dropna()

In [10]:
print(df1)

     Name  ID Salary Role
0  Pankaj   1    100  CEO

In [11]:
df1 = df.dropna(axis=1)
print(df1)

     Name  ID
0  Pankaj   1
1  Meghna   2
2   David   3
3    Lisa   4

In [12]:
df['Salary'].fillna('300', inplace=False)

0    100
1    200
2    300
3    300
Name: Salary, dtype: object

In [13]:
df

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None
2   David   3    NaN   NaT
3    Lisa   4    NaT   NaT

In [14]:
df['Role'].fillna('CEO',inplace=False)

0    CEO
1    CEO
2    CEO
3    CEO
Name: Role, dtype: object

In [15]:
df

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None
2   David   3    NaN   NaT
3    Lisa   4    NaT   NaT

In [16]:
df['Role'].fillna('CEO',inplace=False)
df['Salary'].fillna('300',inplace=False)
df

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None
2   David   3    NaN   NaT
3    Lisa   4    NaT   NaT